In [2]:
from pandas import Series,DataFrame
import pandas as pd

In [3]:
obj = Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj1 = Series([1,4,67,-1],index=['a','b','v','d'])

In [8]:
obj1

a     1
b     4
v    67
d    -1
dtype: int64

In [9]:
obj1['v']

67

In [10]:
obj1['d'] = 44

In [11]:
obj1

a     1
b     4
v    67
d    44
dtype: int64

In [12]:
obj1[obj1>1]

b     4
v    67
d    44
dtype: int64

In [13]:
obj1*2

a      2
b      8
v    134
d     88
dtype: int64

In [14]:
obj1**2

a       1
b      16
v    4489
d    1936
dtype: int64

In [15]:
np

NameError: name 'np' is not defined

In [16]:
'b' in obj1

True

In [17]:
67 in obj1

False

In [18]:
import numpy as np

In [19]:
sdata = {'Ohio':35000,'Texas':710000,'Oregon':16000,'Uath':5000}

In [20]:
obj2 = Series(sdata)

In [21]:
obj2

Ohio       35000
Oregon     16000
Texas     710000
Uath        5000
dtype: int64

In [22]:
states = ['Cal','Ohio','Oregon','Texas']

In [23]:
obj3 = Series(sdata,index=states)

In [24]:
obj3

Cal            NaN
Ohio       35000.0
Oregon     16000.0
Texas     710000.0
dtype: float64

In [25]:
pd.notnull(obj3)

Cal       False
Ohio       True
Oregon     True
Texas      True
dtype: bool

In [26]:
obj2+obj3

Cal             NaN
Ohio        70000.0
Oregon      32000.0
Texas     1420000.0
Uath            NaN
dtype: float64

In [28]:
obj2.name

In [29]:
obj3

Cal            NaN
Ohio       35000.0
Oregon     16000.0
Texas     710000.0
dtype: float64

In [30]:
obj3.name = 'population'

In [31]:
obj3.index.name = 'state'

In [32]:
obj3

state
Cal            NaN
Ohio       35000.0
Oregon     16000.0
Texas     710000.0
Name: population, dtype: float64

In [34]:
obj1

a     1
b     4
v    67
d    44
dtype: int64

In [35]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002],'pop':[1.2,1.6,1.3,1.4,1.6]}

In [36]:
frame = DataFrame(data)

In [37]:
frame

   pop   state  year
0  1.2    Ohio  2000
1  1.6    Ohio  2001
2  1.3    Ohio  2002
3  1.4  Nevada  2001
4  1.6  Nevada  2002

In [39]:
DataFrame(data,columns = ['state','year','pop'])

    state  year  pop
0    Ohio  2000  1.2
1    Ohio  2001  1.6
2    Ohio  2002  1.3
3  Nevada  2001  1.4
4  Nevada  2002  1.6

In [68]:
frame2 = DataFrame(data, columns=['state','year','pop','debt'], index=['one','two','three','four','five'])

In [69]:
frame2

        state  year  pop debt
one      Ohio  2000  1.2  NaN
two      Ohio  2001  1.6  NaN
three    Ohio  2002  1.3  NaN
four   Nevada  2001  1.4  NaN
five   Nevada  2002  1.6  NaN

In [50]:
frame2.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

In [51]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [52]:
frame2.pop

<bound method NDFrame.pop of         state  year  pop debt
one      Ohio  2000  1.2  NaN
two      Ohio  2001  1.6  NaN
three    Ohio  2002  1.3  NaN
four   Nevada  2001  1.4  NaN
five   Nevada  2002  1.6  NaN>

In [53]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [57]:
frame2.ix['one']

state    Ohio
year     2000
pop       1.2
debt      NaN
Name: one, dtype: object

In [58]:
frame2

        state  year  pop debt
one      Ohio  2000  1.2  NaN
two      Ohio  2001  1.6  NaN
three    Ohio  2002  1.3  NaN
four   Nevada  2001  1.4  NaN
five   Nevada  2002  1.6  NaN

In [59]:
frame2['debt'] = 22

In [60]:
frame2

        state  year  pop  debt
one      Ohio  2000  1.2    22
two      Ohio  2001  1.6    22
three    Ohio  2002  1.3    22
four   Nevada  2001  1.4    22
five   Nevada  2002  1.6    22

In [62]:
frame2['debt'] = np.arange(5.)

In [63]:
np.arange(5.)

array([0., 1., 2., 3., 4.])

In [64]:
frame2

        state  year  pop  debt
one      Ohio  2000  1.2   0.0
two      Ohio  2001  1.6   1.0
three    Ohio  2002  1.3   2.0
four   Nevada  2001  1.4   3.0
five   Nevada  2002  1.6   4.0

In [65]:
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [66]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [67]:
frame2

        state  year  pop  debt
one      Ohio  2000  1.2   0.0
two      Ohio  2001  1.6   1.0
three    Ohio  2002  1.3   2.0
four   Nevada  2001  1.4   3.0
five   Nevada  2002  1.6   4.0

In [71]:
frame2['debt']=val

In [72]:
frame2

        state  year  pop  debt
one      Ohio  2000  1.2   NaN
two      Ohio  2001  1.6  -1.2
three    Ohio  2002  1.3   NaN
four   Nevada  2001  1.4  -1.5
five   Nevada  2002  1.6  -1.7

In [73]:
frame2['eastern'] = frame2.state == 'Ohio'

In [74]:
frame2

        state  year  pop  debt  eastern
one      Ohio  2000  1.2   NaN     True
two      Ohio  2001  1.6  -1.2     True
three    Ohio  2002  1.3   NaN     True
four   Nevada  2001  1.4  -1.5    False
five   Nevada  2002  1.6  -1.7    False

In [75]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [76]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [77]:
frame3 = DataFrame(pop)

In [78]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [79]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [81]:
DataFrame(pop,index=[2000,2001,2002,2003])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [82]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [83]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [84]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [85]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [86]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [87]:
frame2.values

array([['Ohio', 2000, 1.2, nan, True],
       ['Ohio', 2001, 1.6, -1.2, True],
       ['Ohio', 2002, 1.3, nan, True],
       ['Nevada', 2001, 1.4, -1.5, False],
       ['Nevada', 2002, 1.6, -1.7, False]], dtype=object)

In [88]:
obj = Series(range(3),index=['a','b','c'])

In [89]:
obj

a    0
b    1
c    2
dtype: int64

In [90]:
index= obj.index

In [91]:
index

Index(['a', 'b', 'c'], dtype='object')

In [93]:
index = pd.Index(np.arange(3))

In [94]:
index

Int64Index([0, 1, 2], dtype='int64')

In [95]:
obj2 = Series([2.3,-4.3,0],index = index)

In [96]:
obj2

0    2.3
1   -4.3
2    0.0
dtype: float64

In [97]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [98]:
'Ohio' in frame3.columns

True

In [99]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [100]:
obj = Series([4.5,-4.5,4.5,3.5],index=['d','b','a','c'])

In [106]:
obj

d    4.5
b   -4.5
a    4.5
c    3.5
dtype: float64

In [102]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [103]:
obj2

a    4.5
b   -4.5
c    3.5
d    4.5
e    NaN
dtype: float64

In [104]:
obj2 = obj.reindex(['a','b','c','d','e'],fill_value = 0)

In [105]:
obj2

a    4.5
b   -4.5
c    3.5
d    4.5
e    0.0
dtype: float64

In [ ]:
obj3